InformationRegisters/абс_СтатусыЗаказовПокупателя/абс_СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СтатусыЗаказовПокупателя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_ПодписиОтветственныхПоОрганизациям/абс_ПодписиОтветственныхПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ПодписиОтветственныхПоОрганизациям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяПодпись</name>
    <type>
      <types>CatalogRef.абс_ПодписиОтветственныхЛиц</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПрофильПолномочийПользователя</name>
    <type>
      <types>CatalogRef.ПрофилиПолномочийПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДанныеПодписи</name>
    <type>
      <types>CatalogRef.абс_ПодписиОтветственныхЛиц</types>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/лео_ЗаполнениеРеквизитовДокументов/Module.bsl
Процедура ЗаполнитьСтатьюДДСОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Источник.Оплачено = Ложь Тогда
		// {Лео_Катанович
		
		Если Источник.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Источник.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СтатьяДвиженияДенежныхСредств =  УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяСтатьяДДСДляПлатежногоПорученияИсходящего");
		КонецЕсли;
	КонецЕсли;                                                                                                                                        
	
КонецПроцедуры

Процедура лео_ПриПометкеУдаленияОчиститьСтатусыЗаказа(Источник, Отказ) Экспорт
	
	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Создан;
	НаборЗаписей = РегистрыСведений.абс_СтатусыЗаказовПокупателя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Источник.Ссылка);	
	НаборЗаписей.Записать();
	
КонецПроцедуры				   

Процедура СформироватьОтчетПродажиТопыркинЛеотон() Экспорт
	
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура СформироватьОтчетПродажиТопыркинЛефЭкспо() Экспорт
	
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
КонецПроцедуры	                                                        

Функция ПолучитьПодписьОтветственного(ВыводитьОснование=Истина, ДокументОснование = Неопределено) Экспорт
	
	РуководительФизЛицо     =  ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
    ГлавныйБухгалтерФизЛицо =  ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	
	ОсновнаяПодписьРук = Справочники.Пользователи.ПустаяСсылка().абс_ДанныеПодписи;
	ОсновнаяПодписьБух = Справочники.Пользователи.ПустаяСсылка().абс_ДанныеПодписи;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если Не ДокументОснование.Метаданные().Реквизиты.Найти("ОтпускРазрешил") = Неопределено Тогда
			Если ЗначениеЗаполнено(ДокументОснование.ОтпускРазрешил) Тогда
			     РуководительФизЛицо =  ДокументОснование.ОтпускРазрешил;
			КонецЕсли;	 
        КонецЕсли;
		Если Не ДокументОснование.Метаданные().Реквизиты.Найти("ГлавныйБухгалтер") = Неопределено Тогда
			Если ЗначениеЗаполнено(ДокументОснование.ГлавныйБухгалтер) Тогда
		         ГлавныйБухгалтерФизЛицо =  ДокументОснование.ГлавныйБухгалтер;
			  КонецЕсли;

        КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапросРук.ОсновнаяПодписьРук,
		|	ВложенныйЗапросБух.ОсновнаяПодписьБух
		|ИЗ
		|	(ВЫБРАТЬ
		|		абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.ОсновнаяПодпись КАК ОсновнаяПодписьРук
		|	ИЗ
		|		РегистрСведений.абс_ПодписиОтветственныхПоОрганизациям.СрезПоследних(&ДатаДок, Организация = &Организация) КАК абс_ПодписиОтветственныхПоОрганизациямСрезПоследних
		|	ГДЕ
		|		абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь.ФизЛицо = &РуководительФизЛицо) КАК ВложенныйЗапросРук
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			абс_ПодписиОтветственныхПоОрганизациямСрезПоследних1.ОсновнаяПодпись КАК ОсновнаяПодписьБух
		|		ИЗ
		|			РегистрСведений.абс_ПодписиОтветственныхПоОрганизациям.СрезПоследних(&ДатаДок, Организация = &Организация) КАК абс_ПодписиОтветственныхПоОрганизациямСрезПоследних1
		|		ГДЕ
		|			абс_ПодписиОтветственныхПоОрганизациямСрезПоследних1.Пользователь.ФизЛицо = &ГлавныйБухгалтерФизЛицо) КАК ВложенныйЗапросБух
		|		ПО (ИСТИНА)";
		
		Запрос.УстановитьПараметр("Организация",             ДокументОснование.Организация);
		Запрос.УстановитьПараметр("ДатаДок",                 ДокументОснование.Дата);
		Запрос.УстановитьПараметр("РуководительФизЛицо",     РуководительФизЛицо);
		Запрос.УстановитьПараметр("ГлавныйБухгалтерФизЛицо", ГлавныйБухгалтерФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.ОсновнаяПодписьРук) Тогда
			     ОсновнаяПодписьРук = Выборка.ОсновнаяПодписьРук;
			 КонецЕсли;	
			 Если ЗначениеЗаполнено(Выборка.ОсновнаяПодписьБух) Тогда
			     ОсновнаяПодписьБух = Выборка.ОсновнаяПодписьБух;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Если Не ДокументОснование.Метаданные().Реквизиты.Найти("ОтпускРазрешил") = Неопределено Тогда
		Если ЗначениеЗаполнено(ДокументОснование.ОтпускРазрешил) И НЕ ЗначениеЗаполнено(ОсновнаяПодписьРук.ФизЛицо) Тогда
			сообщить("Нет права подписи: " +  РуководительФизЛицо);
		КонецЕсли;	 
	КонецЕсли;
	Если Не ДокументОснование.Метаданные().Реквизиты.Найти("ГлавныйБухгалтер") = Неопределено Тогда
		Если ЗначениеЗаполнено(ДокументОснование.ГлавныйБухгалтер) И НЕ ЗначениеЗаполнено(ОсновнаяПодписьБух.ФизЛицо) Тогда
			сообщить("Нет права подписи: " +  ГлавныйБухгалтерФизЛицо);
		КонецЕсли;	 
	КонецЕсли;
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ДокументОснование.Организация, ДокументОснование.Дата);
	
	СтруктураПодписи = Новый Структура();
	
	СтруктураПодписи.Вставить("ФизЛицоРук"				, ?(ЗначениеЗаполнено(ОсновнаяПодписьРук.ФизЛицо),ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодписьРук.ФизЛицо.Наименование),Руководители.Руководитель));
	СтруктураПодписи.Вставить("ДолжностьРук"			, ?(ЗначениеЗаполнено(ОсновнаяПодписьРук.Должность),ОсновнаяПодписьРук.Должность,Руководители.РуководительДолжность));
	СтруктураПодписи.Вставить("ДокументОснованиеРук"	, ОсновнаяПодписьРук.ДокументОснование);
	СтруктураПодписи.Вставить("РасшифровкаПодписиРук"	, ?(ВыводитьОснование,СтруктураПодписи.ФизЛицоРук + Символы.ПС + ОсновнаяПодписьРук.ДокументОснование, СтруктураПодписи.ФизЛицоРук));
	
	СтруктураПодписи.Вставить("ФизЛицоБух"				, ?(ЗначениеЗаполнено(ОсновнаяПодписьБух.ФизЛицо),ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодписьБух.ФизЛицо.Наименование),Руководители.ГлавныйБухгалтер));
	СтруктураПодписи.Вставить("ДолжностьБух"			, ?(ЗначениеЗаполнено(ОсновнаяПодписьБух.Должность),ОсновнаяПодписьБух.Должность,""));
	СтруктураПодписи.Вставить("ДокументОснованиеБух"	, ОсновнаяПодписьБух.ДокументОснование);
	СтруктураПодписи.Вставить("РасшифровкаПодписиБух"	, ?(ВыводитьОснование,СтруктураПодписи.ФизЛицоБух + Символы.ПС + ОсновнаяПодписьБух.ДокументОснование, СтруктураПодписи.ФизЛицоБух));

	
	Возврат СтруктураПодписи;
	
КонецФункции
